{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0151deab-ec4e-4738-b9b0-fec2424b2da3",
   "metadata": {},
   "source": [
    "# Querying Knowledge Graphs with Cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "74b00a43-df0b-4ead-8de6-2365e8a26f53",
   "metadata": {},
   "source": [
    "### Import packages and set up Neo4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "bc780563-88e7-4c75-92c7-eb34def44a9f",
   "metadata": {
    "height": 149
   },
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "import pandas as pd\n",
    "\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "_ = load_dotenv()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "089b045d",
   "metadata": {},
   "source": [
    "### Setting Environment Variables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "186948fd-da5e-49d5-abf4-ad21aed3271f",
   "metadata": {
    "height": 98
   },
   "outputs": [],
   "source": [
    "os.environ[\"NEO4J_USERNAME\"] = os.getenv(\"NEO4J_USERNAME\")\n",
    "os.environ[\"NEO4J_PASSWORD\"] = os.getenv(\"NEO4J_PASSWORD\")\n",
    "os.environ[\"NEO4J_URI\"] = os.getenv(\"NEO4J_URI\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a057a4bf",
   "metadata": {},
   "source": [
    "### Loading the Dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "09d54c63",
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.read_csv('../data/vgsales.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "1f64075e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(16598, 11)"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "69a4ba0f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Rank</th>\n",
       "      <th>Name</th>\n",
       "      <th>Platform</th>\n",
       "      <th>Year</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Publisher</th>\n",
       "      <th>NA_Sales</th>\n",
       "      <th>EU_Sales</th>\n",
       "      <th>JP_Sales</th>\n",
       "      <th>Other_Sales</th>\n",
       "      <th>Global_Sales</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Wii Sports</td>\n",
       "      <td>Wii</td>\n",
       "      <td>2006.0</td>\n",
       "      <td>Sports</td>\n",
       "      <td>Nintendo</td>\n",
       "      <td>41.49</td>\n",
       "      <td>29.02</td>\n",
       "      <td>3.77</td>\n",
       "      <td>8.46</td>\n",
       "      <td>82.74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Super Mario Bros.</td>\n",
       "      <td>NES</td>\n",
       "      <td>1985.0</td>\n",
       "      <td>Platform</td>\n",
       "      <td>Nintendo</td>\n",
       "      <td>29.08</td>\n",
       "      <td>3.58</td>\n",
       "      <td>6.81</td>\n",
       "      <td>0.77</td>\n",
       "      <td>40.24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Mario Kart Wii</td>\n",
       "      <td>Wii</td>\n",
       "      <td>2008.0</td>\n",
       "      <td>Racing</td>\n",
       "      <td>Nintendo</td>\n",
       "      <td>15.85</td>\n",
       "      <td>12.88</td>\n",
       "      <td>3.79</td>\n",
       "      <td>3.31</td>\n",
       "      <td>35.82</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Wii Sports Resort</td>\n",
       "      <td>Wii</td>\n",
       "      <td>2009.0</td>\n",
       "      <td>Sports</td>\n",
       "      <td>Nintendo</td>\n",
       "      <td>15.75</td>\n",
       "      <td>11.01</td>\n",
       "      <td>3.28</td>\n",
       "      <td>2.96</td>\n",
       "      <td>33.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Pokemon Red/Pokemon Blue</td>\n",
       "      <td>GB</td>\n",
       "      <td>1996.0</td>\n",
       "      <td>Role-Playing</td>\n",
       "      <td>Nintendo</td>\n",
       "      <td>11.27</td>\n",
       "      <td>8.89</td>\n",
       "      <td>10.22</td>\n",
       "      <td>1.00</td>\n",
       "      <td>31.37</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Rank                      Name Platform    Year         Genre Publisher  \\\n",
       "0     1                Wii Sports      Wii  2006.0        Sports  Nintendo   \n",
       "1     2         Super Mario Bros.      NES  1985.0      Platform  Nintendo   \n",
       "2     3            Mario Kart Wii      Wii  2008.0        Racing  Nintendo   \n",
       "3     4         Wii Sports Resort      Wii  2009.0        Sports  Nintendo   \n",
       "4     5  Pokemon Red/Pokemon Blue       GB  1996.0  Role-Playing  Nintendo   \n",
       "\n",
       "   NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales  \n",
       "0     41.49     29.02      3.77         8.46         82.74  \n",
       "1     29.08      3.58      6.81         0.77         40.24  \n",
       "2     15.85     12.88      3.79         3.31         35.82  \n",
       "3     15.75     11.01      3.28         2.96         33.00  \n",
       "4     11.27      8.89     10.22         1.00         31.37  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "80d05d2e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Rank</th>\n",
       "      <th>Name</th>\n",
       "      <th>Platform</th>\n",
       "      <th>Year</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Publisher</th>\n",
       "      <th>NA_Sales</th>\n",
       "      <th>EU_Sales</th>\n",
       "      <th>JP_Sales</th>\n",
       "      <th>Other_Sales</th>\n",
       "      <th>Global_Sales</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>16593</th>\n",
       "      <td>16596</td>\n",
       "      <td>Woody Woodpecker in Crazy Castle 5</td>\n",
       "      <td>GBA</td>\n",
       "      <td>2002.0</td>\n",
       "      <td>Platform</td>\n",
       "      <td>Kemco</td>\n",
       "      <td>0.01</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16594</th>\n",
       "      <td>16597</td>\n",
       "      <td>Men in Black II: Alien Escape</td>\n",
       "      <td>GC</td>\n",
       "      <td>2003.0</td>\n",
       "      <td>Shooter</td>\n",
       "      <td>Infogrames</td>\n",
       "      <td>0.01</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16595</th>\n",
       "      <td>16598</td>\n",
       "      <td>SCORE International Baja 1000: The Official Game</td>\n",
       "      <td>PS2</td>\n",
       "      <td>2008.0</td>\n",
       "      <td>Racing</td>\n",
       "      <td>Activision</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16596</th>\n",
       "      <td>16599</td>\n",
       "      <td>Know How 2</td>\n",
       "      <td>DS</td>\n",
       "      <td>2010.0</td>\n",
       "      <td>Puzzle</td>\n",
       "      <td>7G//AMES</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.01</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16597</th>\n",
       "      <td>16600</td>\n",
       "      <td>Spirits &amp; Spells</td>\n",
       "      <td>GBA</td>\n",
       "      <td>2003.0</td>\n",
       "      <td>Platform</td>\n",
       "      <td>Wanadoo</td>\n",
       "      <td>0.01</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.01</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Rank                                              Name Platform  \\\n",
       "16593  16596                Woody Woodpecker in Crazy Castle 5      GBA   \n",
       "16594  16597                     Men in Black II: Alien Escape       GC   \n",
       "16595  16598  SCORE International Baja 1000: The Official Game      PS2   \n",
       "16596  16599                                        Know How 2       DS   \n",
       "16597  16600                                  Spirits & Spells      GBA   \n",
       "\n",
       "         Year     Genre   Publisher  NA_Sales  EU_Sales  JP_Sales  \\\n",
       "16593  2002.0  Platform       Kemco      0.01      0.00       0.0   \n",
       "16594  2003.0   Shooter  Infogrames      0.01      0.00       0.0   \n",
       "16595  2008.0    Racing  Activision      0.00      0.00       0.0   \n",
       "16596  2010.0    Puzzle    7G//AMES      0.00      0.01       0.0   \n",
       "16597  2003.0  Platform     Wanadoo      0.01      0.00       0.0   \n",
       "\n",
       "       Other_Sales  Global_Sales  \n",
       "16593          0.0          0.01  \n",
       "16594          0.0          0.01  \n",
       "16595          0.0          0.01  \n",
       "16596          0.0          0.01  \n",
       "16597          0.0          0.01  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.tail()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "2a48a1bd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "16598"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df['Rank'].nunique()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "26ac45a1",
   "metadata": {},
   "source": [
    "### Conversion of CSV to Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7a8affe7-9424-47d4-97c7-0a675fc2398f",
   "metadata": {},
   "source": [
    "- Initialize a knowledge graph instance using LangChain's Neo4j integration"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "a5c03340-9078-42b2-9e0a-2dc8495b818f",
   "metadata": {
    "height": 64
   },
   "outputs": [],
   "source": [
    "kg = Neo4jGraph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "f3f27271",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "vgsales_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'https://raw.githubusercontent.com/KNAI-AI/knai-workshop/main/data/vgsales.csv' AS row\n",
    "MERGE (g:Game {rank:toInteger(row.Rank)})\n",
    "SET g.name = row.Name,\n",
    "    g.platform = row.Platform,\n",
    "    g.year = toInteger(row.Year),\n",
    "    g.genre = row.Genre,\n",
    "    g.publisher = row.Publisher,\n",
    "    g.na_sales = toFloat(row.NA_Sales),\n",
    "    g.eu_sales = toFloat(row.EU_Sales),\n",
    "    g.jp_sales = toFloat(row.JP_Sales),\n",
    "    g.other_sales = toFloat(row.Other_Sales),\n",
    "    g.global_sales = toFloat(row.Global_Sales)\n",
    "\n",
    "MERGE (p:Platform {name:row.Platform})\n",
    "MERGE (g)-[:RELEASED_ON]->(p)\n",
    "\n",
    "MERGE (pub:Publisher {name:row.Publisher})\n",
    "MERGE (g)-[:PUBLISHED_BY]->(pub)\n",
    "\n",
    "MERGE (ge:Genre {name:row.Genre})\n",
    "MERGE (g)-[:BELONGS_TO_GENRE]->(ge)\n",
    "\"\"\"\n",
    "\n",
    "kg.query(vgsales_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "79937959",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Game {name: STRING, rank: INTEGER, platform: STRING, year: INTEGER, genre: STRING, publisher: STRING, na_sales: FLOAT, eu_sales: FLOAT, jp_sales: FLOAT, other_sales: FLOAT, global_sales: FLOAT}\n",
      "Platform {name: STRING}\n",
      "Publisher {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Game)-[:RELEASED_ON]->(:Platform)\n",
      "(:Game)-[:PUBLISHED_BY]->(:Publisher)\n",
      "(:Game)-[:BELONGS_TO_GENRE]->(:Genre)\n"
     ]
    }
   ],
   "source": [
    "kg.refresh_schema()\n",
    "print(kg.schema)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a703052f-c74e-4933-8e62-7e3ec9b12986",
   "metadata": {},
   "source": [
    "### Querying the movie knowledge graph \n",
    "- Match all nodes in the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "b12cfece-6188-4fa4-8ba6-f0eff39c6546",
   "metadata": {
    "height": 81,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "edef9911-c436-4159-ae6b-412557448b94",
   "metadata": {
    "height": 47,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 17220}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = kg.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "751a9532-114d-4f72-8956-da41aa7eae8d",
   "metadata": {
    "height": 81
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n) AS numberOfNodes\n",
    "  \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "4fd44fea-11ab-4828-b475-71bc450ee900",
   "metadata": {
    "height": 47
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfNodes': 17220}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = kg.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "4ae04daa-bc4c-42ca-864a-79b3915a234e",
   "metadata": {
    "height": 30
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 17220 nodes in this graph.\n"
     ]
    }
   ],
   "source": [
    "print(f\"There are {result[0]['numberOfNodes']} nodes in this graph.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ef33d57e-7f3a-4d66-b4d0-325973604906",
   "metadata": {},
   "source": [
    "- Match only the `Game` nodes by specifying the node label"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "7ebd1092-e6d4-4112-aac9-ce2af1eaa737",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfGames': 16598}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n:Game) \n",
    "  RETURN count(n) AS numberOfGames\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78ca792e-831f-4f1a-b728-92928d41e9b6",
   "metadata": {},
   "source": [
    "- Change the variable name in the node pattern match for improved readability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "26b1ed1f-c780-4de8-8c96-5594bc8b63af",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfGames': 16598}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (g:Game) \n",
    "  RETURN count(g) AS numberOfGames\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0534a64-f4c0-4e22-a79d-cce5ef595aa3",
   "metadata": {},
   "source": [
    "- Match only the `Publisher` nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "5b7d6465-19a7-4f0c-b2a3-f32fd5991c46",
   "metadata": {
    "height": 98,
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfPublishers': 579}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (publisher:Publisher) \n",
    "  RETURN count(publisher) AS numberOfPublishers\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "209a950f-3335-4a47-801c-53a821529cc7",
   "metadata": {},
   "source": [
    "- Match a single publisher by specifying the value of the `name` property on the `Publisher` node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "1c1f5e93-39dc-4585-ba3a-2cd492cbf665",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nintendo': {'name': 'Nintendo'}}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (nintendo:Publisher {name:\"Nintendo\"}) \n",
    "  RETURN nintendo\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f6debaf-f237-4b75-b18c-5ff56ccca780",
   "metadata": {},
   "source": [
    "- Return only the `global_sales` property of the matched `Game` node"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "2c9d8fc2-4fc7-4e85-8ced-e3f0236e6b2f",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'gta.global_sales': 20.81},\n",
       " {'gta.global_sales': 1.95},\n",
       " {'gta.global_sales': 0.98},\n",
       " {'gta.global_sales': 0.12}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (gta:Game {name:\"Grand Theft Auto: San Andreas\"}) \n",
    "  RETURN gta.global_sales\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "00e73a39-882c-4060-926e-deb484a4358f",
   "metadata": {},
   "source": [
    "- Return two properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "64ad1276-c1cc-49d6-b7e9-d7126a37fabc",
   "metadata": {
    "height": 98
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (marioBros:Game {name:\"New Super Mario Bros.\"}) \n",
    "  RETURN marioBros.global_sales, marioBros.publisher\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "689be729-367a-408b-b4e5-43d2a3d69744",
   "metadata": {},
   "source": [
    "### Cypher patterns with conditional matching"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "fc7b4d4d-764e-4b83-ae7c-0f7717de85f2",
   "metadata": {
    "height": 132
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (nineties:Game) \n",
    "  WHERE nineties.year >= 1990 \n",
    "    AND nineties.year < 2000 \n",
    "  RETURN nineties.name\n",
    "  \"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "c52524e8-c4b2-443a-9e4b-01c50f0be352",
   "metadata": {
    "height": 30
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nineties.name': 'Pokemon Red/Pokemon Blue'},\n",
       " {'nineties.name': 'Pokemon Gold/Pokemon Silver'},\n",
       " {'nineties.name': 'Super Mario World'},\n",
       " {'nineties.name': 'Pokémon Yellow: Special Pikachu Edition'},\n",
       " {'nineties.name': 'Super Mario 64'},\n",
       " {'nineties.name': 'Super Mario Land 2: 6 Golden Coins'},\n",
       " {'nineties.name': 'Gran Turismo'},\n",
       " {'nineties.name': 'Super Mario All-Stars'},\n",
       " {'nineties.name': 'Mario Kart 64'},\n",
       " {'nineties.name': 'Final Fantasy VII'},\n",
       " {'nineties.name': 'Gran Turismo 2'},\n",
       " {'nineties.name': 'Donkey Kong Country'},\n",
       " {'nineties.name': 'Super Mario Kart'},\n",
       " {'nineties.name': 'GoldenEye 007'},\n",
       " {'nineties.name': 'Final Fantasy VIII'},\n",
       " {'nineties.name': 'The Legend of Zelda: Ocarina of Time'},\n",
       " {'nineties.name': 'Crash Bandicoot 2: Cortex Strikes Back'},\n",
       " {'nineties.name': 'Tekken 3'},\n",
       " {'nineties.name': 'Crash Bandicoot 3: Warped'},\n",
       " {'nineties.name': 'Crash Bandicoot'},\n",
       " {'nineties.name': 'Street Fighter II: The World Warrior'},\n",
       " {'nineties.name': 'Driver'},\n",
       " {'nineties.name': 'Sonic the Hedgehog 2'},\n",
       " {'nineties.name': 'Metal Gear Solid'},\n",
       " {'nineties.name': 'Resident Evil 2'},\n",
       " {'nineties.name': 'Tekken 2'},\n",
       " {'nineties.name': 'Super Smash Bros.'},\n",
       " {'nineties.name': 'Pokemon Stadium'},\n",
       " {'nineties.name': 'Pokemon Pinball'},\n",
       " {'nineties.name': 'Donkey Kong 64'},\n",
       " {'nineties.name': 'Tomb Raider II'},\n",
       " {'nineties.name': 'Super Mario Land 3: Wario Land'},\n",
       " {'nineties.name': \"Donkey Kong Country 2: Diddy's Kong Quest\"},\n",
       " {'nineties.name': \"Kirby's Dream Land\"},\n",
       " {'nineties.name': 'Microsoft Flight Simulator'},\n",
       " {'nineties.name': 'Super Mario Bros.'},\n",
       " {'nineties.name': 'Resident Evil'},\n",
       " {'nineties.name': \"Tony Hawk's Pro Skater\"},\n",
       " {'nineties.name': 'Warzone 2100'},\n",
       " {'nineties.name': 'Spyro the Dragon'},\n",
       " {'nineties.name': 'Diddy Kong Racing'},\n",
       " {'nineties.name': 'Dr. Mario'},\n",
       " {'nineties.name': 'Crash Team Racing'},\n",
       " {'nineties.name': 'Tomb Raider'},\n",
       " {'nineties.name': 'The Legend of Zelda: A Link to the Past'},\n",
       " {'nineties.name': 'Sonic the Hedgehog'},\n",
       " {'nineties.name': 'Warcraft II: Tides of Darkness'},\n",
       " {'nineties.name': 'Frogger'},\n",
       " {'nineties.name': 'Half-Life'},\n",
       " {'nineties.name': \"Super Mario World 2: Yoshi's Island\"},\n",
       " {'nineties.name': 'Street Fighter II Turbo'},\n",
       " {'nineties.name': 'Namco Museum Vol.3'},\n",
       " {'nineties.name': 'Star Fox 64'},\n",
       " {'nineties.name': 'Donkey Kong Land'},\n",
       " {'nineties.name': 'Namco Museum Vol.1'},\n",
       " {'nineties.name': \"The Legend of Zelda: Link's Awakening\"},\n",
       " {'nineties.name': \"Resident Evil Director's Cut\"},\n",
       " {'nineties.name': 'Resident Evil 3: Nemesis'},\n",
       " {'nineties.name': 'Pokémon Trading Card Game'},\n",
       " {'nineties.name': 'Banjo-Kazooie'},\n",
       " {'nineties.name': 'Pokemon Snap'},\n",
       " {'nineties.name': 'Doom II: Hell on Earth'},\n",
       " {'nineties.name': 'Croc: Legend of the Gobbos'},\n",
       " {'nineties.name': 'Tomb Raider III: Adventures of Lara Croft'},\n",
       " {'nineties.name': \"Spyro 2: Ripto's Rage!\"},\n",
       " {'nineties.name': \"Donkey Kong Country 3: Dixie Kong's Double Trouble!\"},\n",
       " {'nineties.name': 'Grand Theft Auto 2'},\n",
       " {'nineties.name': 'Final Fantasy III'},\n",
       " {'nineties.name': 'F-1 Race'},\n",
       " {'nineties.name': 'WWF War Zone'},\n",
       " {'nineties.name': 'Rugrats: Search For Reptar'},\n",
       " {'nineties.name': 'Tekken'},\n",
       " {'nineties.name': '007: Tomorrow Never Dies'},\n",
       " {'nineties.name': 'Killer Instinct'},\n",
       " {'nineties.name': 'Dragon Quest VI: Maboroshi no Daichi'},\n",
       " {'nineties.name': 'Need for Speed III: Hot Pursuit'},\n",
       " {'nineties.name': 'Star Wars Episode I Racer'},\n",
       " {'nineties.name': 'Dragon Warrior IV'},\n",
       " {'nineties.name': 'Donkey Kong'},\n",
       " {'nineties.name': 'Rayman'},\n",
       " {'nineties.name': 'Star Fox'},\n",
       " {'nineties.name': 'Wave Race 64'},\n",
       " {'nineties.name': 'Syphon Filter'},\n",
       " {'nineties.name': 'Colin McRae Rally'},\n",
       " {'nineties.name': 'F-Zero'},\n",
       " {'nineties.name': \"Yoshi's Story\"},\n",
       " {'nineties.name': 'Command & Conquer: Red Alert'},\n",
       " {'nineties.name': 'Myst'},\n",
       " {'nineties.name': 'Hot Shots Golf'},\n",
       " {'nineties.name': \"A Bug's Life\"},\n",
       " {'nineties.name': 'Dragon Quest V: Tenkuu no Hanayome'},\n",
       " {'nineties.name': 'Mortal Kombat Trilogy'},\n",
       " {'nineties.name': 'Mario Paint'},\n",
       " {'nineties.name': 'Mario Party'},\n",
       " {'nineties.name': 'Mortal Kombat'},\n",
       " {'nineties.name': 'Medal of Honor'},\n",
       " {'nineties.name': 'Star Wars: Shadows of the Empire'},\n",
       " {'nineties.name': 'Streets of Rage'},\n",
       " {'nineties.name': 'Mario Party 2'},\n",
       " {'nineties.name': 'Tomb Raider: The Last Revelation'},\n",
       " {'nineties.name': 'Final Fantasy V'},\n",
       " {'nineties.name': 'Final Fantasy Tactics'},\n",
       " {'nineties.name': 'Twisted Metal 2'},\n",
       " {'nineties.name': 'Riven: The Sequel to Myst'},\n",
       " {'nineties.name': 'Sonic Adventure'},\n",
       " {'nineties.name': 'Dino Crisis'},\n",
       " {'nineties.name': 'Tetris Plus'},\n",
       " {'nineties.name': 'Theme Hospital'},\n",
       " {'nineties.name': 'Monopoly'},\n",
       " {'nineties.name': 'WCW/nWo Revenge'},\n",
       " {'nineties.name': \"Kirby's Dream Land 2\"},\n",
       " {'nineties.name': 'Donkey Kong Land II'},\n",
       " {'nineties.name': 'Dragon Warrior Monsters'},\n",
       " {'nineties.name': 'Grand Theft Auto'},\n",
       " {'nineties.name': 'Need For Speed: High Stakes'},\n",
       " {'nineties.name': 'Chrono Trigger'},\n",
       " {'nineties.name': 'Cool Boarders 3'},\n",
       " {'nineties.name': 'Tomb Raider II'},\n",
       " {'nineties.name': 'TOCA Touring Car Championship'},\n",
       " {'nineties.name': 'Cool Boarders 2'},\n",
       " {'nineties.name': 'Teenage Mutant Ninja Turtles II: The Arcade Game'},\n",
       " {'nineties.name': \"The Legend of Zelda: Link's Awakening DX\"},\n",
       " {'nineties.name': \"Kirby's Pinball Land\"},\n",
       " {'nineties.name': 'Star Wars: Rogue Squadron'},\n",
       " {'nineties.name': 'Super Mario RPG: Legend of the Seven Stars'},\n",
       " {'nineties.name': 'SimCity 2000'},\n",
       " {'nineties.name': 'Parasite Eve'},\n",
       " {'nineties.name': 'Derby Stallion'},\n",
       " {'nineties.name': 'Sim Theme Park'},\n",
       " {'nineties.name': 'Warcraft: Orcs & Humans'},\n",
       " {'nineties.name': 'R4: Ridge Racer Type 4'},\n",
       " {'nineties.name': 'NBA Jam'},\n",
       " {'nineties.name': '1080°: TenEighty Snowboarding'},\n",
       " {'nineties.name': 'Super Street Fighter II'},\n",
       " {'nineties.name': 'Tenchu: Stealth Assassins'},\n",
       " {'nineties.name': 'SimCity'},\n",
       " {'nineties.name': 'Star Wars: Dark Forces'},\n",
       " {'nineties.name': 'Who wants to be a millionaire'},\n",
       " {'nineties.name': 'Jet Moto 2'},\n",
       " {'nineties.name': 'Mortal Kombat II'},\n",
       " {'nineties.name': 'Virtua Fighter 2'},\n",
       " {'nineties.name': 'Tetris DX'},\n",
       " {'nineties.name': 'PaRappa The Rapper'},\n",
       " {'nineties.name': 'Yu-Gi-Oh! Forbidden Memories'},\n",
       " {'nineties.name': 'Hot Shots Golf 2'},\n",
       " {'nineties.name': 'WCW Nitro'},\n",
       " {'nineties.name': 'FIFA 2000'},\n",
       " {'nineties.name': 'The Legend of Dragoon'},\n",
       " {'nineties.name': 'Turok 2: Seeds of Evil'},\n",
       " {'nineties.name': 'Chrono Cross'},\n",
       " {'nineties.name': 'Hey You, Pikachu!'},\n",
       " {'nineties.name': 'Jet Moto'},\n",
       " {'nineties.name': 'Secret of Mana'},\n",
       " {'nineties.name': 'Air Combat'},\n",
       " {'nineties.name': 'Sonic & Knuckles'},\n",
       " {'nineties.name': 'NFL GameDay 2000'},\n",
       " {'nineties.name': \"Disney's The Lion King\"},\n",
       " {'nineties.name': 'Final Fantasy II'},\n",
       " {'nineties.name': 'Metroid II: Return of Samus'},\n",
       " {'nineties.name': 'WWF Attitude'},\n",
       " {'nineties.name': 'Sonic the Hedgehog 3'},\n",
       " {'nineties.name': 'Madden NFL 2000'},\n",
       " {'nineties.name': 'Yoshi'},\n",
       " {'nineties.name': \"Disney's Aladdin\"},\n",
       " {'nineties.name': \"Kirby's Adventure\"},\n",
       " {'nineties.name': 'Star Wars Episode I: The Phantom Menace'},\n",
       " {'nineties.name': \"Cruis'n USA\"},\n",
       " {'nineties.name': 'Madden NFL 99'},\n",
       " {'nineties.name': 'Twisted Metal III'},\n",
       " {'nineties.name': 'Toy Story 2: Buzz Lightyear to the Rescue!'},\n",
       " {'nineties.name': 'Super Puyo Puyo'},\n",
       " {'nineties.name': \"Jampack Winter '99\"},\n",
       " {'nineties.name': 'WCW vs. nWo: World Tour'},\n",
       " {'nineties.name': 'WCW/NWO Thunder'},\n",
       " {'nineties.name': 'NFL GameDay 98'},\n",
       " {'nineties.name': \"Yoshi's Cookie\"},\n",
       " {'nineties.name': 'Time Crisis'},\n",
       " {'nineties.name': \"Street Fighter II': Special Champion Edition\"},\n",
       " {'nineties.name': 'Super Scope 6'},\n",
       " {'nineties.name': \"Tom Clancy's Rainbow Six\"},\n",
       " {'nineties.name': 'Ape Escape'},\n",
       " {'nineties.name': 'Sled Storm'},\n",
       " {'nineties.name': 'Yu-Gi-Oh! Duel Monsters'},\n",
       " {'nineties.name': 'F-1 World Grand Prix'},\n",
       " {'nineties.name': 'Silent Hill'},\n",
       " {'nineties.name': 'Diablo'},\n",
       " {'nineties.name': 'Soul Edge'},\n",
       " {'nineties.name': 'NASCAR 2000'},\n",
       " {'nineties.name': 'Twisted Metal'},\n",
       " {'nineties.name': 'Final Fight'},\n",
       " {'nineties.name': 'Command & Conquer: Tiberian Sun'},\n",
       " {'nineties.name': 'Die Hard Trilogy'},\n",
       " {'nineties.name': 'Mortal Kombat 3'},\n",
       " {'nineties.name': 'NFL GameDay 99'},\n",
       " {'nineties.name': 'Tiger Woods 99 PGA Tour Golf'},\n",
       " {'nineties.name': 'Knockout Kings'},\n",
       " {'nineties.name': 'NASCAR 98'},\n",
       " {'nineties.name': 'NASCAR 99'},\n",
       " {'nineties.name': 'NBA Live 2000'},\n",
       " {'nineties.name': 'NBA Live 98'},\n",
       " {'nineties.name': 'Monopoly'},\n",
       " {'nineties.name': 'NFL Blitz'},\n",
       " {'nineties.name': 'Sonic CD'},\n",
       " {'nineties.name': 'Pac-Man World'},\n",
       " {'nineties.name': 'Nintendo World Cup'},\n",
       " {'nineties.name': 'WWF WrestleMania 2000'},\n",
       " {'nineties.name': 'Wario Land II'},\n",
       " {'nineties.name': 'Mario Golf'},\n",
       " {'nineties.name': 'Xenogears'},\n",
       " {'nineties.name': 'Mortal Kombat 4'},\n",
       " {'nineties.name': 'WCW vs the World'},\n",
       " {'nineties.name': 'Tamagotchi'},\n",
       " {'nineties.name': 'Dragon Ball Z'},\n",
       " {'nineties.name': 'Game de Hakken!! Tamagotchi 2'},\n",
       " {'nineties.name': 'Namco Museum 64'},\n",
       " {'nineties.name': 'Kirby Super Star'},\n",
       " {'nineties.name': \"Frogger 2: Swampy's Revenge\"},\n",
       " {'nineties.name': 'Triple Play 2000'},\n",
       " {'nineties.name': 'Super Metroid'},\n",
       " {'nineties.name': \"Disney's The Lion King\"},\n",
       " {'nineties.name': 'Knockout Kings 2000'},\n",
       " {'nineties.name': '2Xtreme'},\n",
       " {'nineties.name': 'Final Fantasy III'},\n",
       " {'nineties.name': 'NBA Jam'},\n",
       " {'nineties.name': 'Teenage Mutant Ninja Turtles III: The Manhattan Project'},\n",
       " {'nineties.name': 'Duke Nukem: Time to Kill'},\n",
       " {'nineties.name': 'A Collection of Activision Classic Games for the Atari 2600'},\n",
       " {'nineties.name': 'Pocket Monsters Stadium'},\n",
       " {'nineties.name': 'Dragon Quest III: Soshite Densetsu e...'},\n",
       " {'nineties.name': 'Dance Dance Revolution (Japan)'},\n",
       " {'nineties.name': 'Madden NFL 98'},\n",
       " {'nineties.name': 'SaGa Frontier'},\n",
       " {'nineties.name': 'Mortal Kombat 3'},\n",
       " {'nineties.name': 'WWF War Zone'},\n",
       " {'nineties.name': 'TOCA 2: Touring Cars'},\n",
       " {'nineties.name': 'Fighting Force'},\n",
       " {'nineties.name': 'Madden NFL 97'},\n",
       " {'nineties.name': 'TNN Motor Sports Hardcore 4x4'},\n",
       " {'nineties.name': 'Rugrats Studio Tour'},\n",
       " {'nineties.name': 'Test Drive 5'},\n",
       " {'nineties.name': 'Romancing SaGa 3'},\n",
       " {'nineties.name': 'Digimon World'},\n",
       " {'nineties.name': 'Army Men 3D'},\n",
       " {'nineties.name': 'Twisted Metal 4'},\n",
       " {'nineties.name': 'Castlevania: Symphony of the Night'},\n",
       " {'nineties.name': 'Road Rash'},\n",
       " {'nineties.name': 'Battle Arena Toshinden'},\n",
       " {'nineties.name': 'Devil Dice'},\n",
       " {'nineties.name': 'Brian Lara Cricket'},\n",
       " {'nineties.name': 'Wheel of Fortune'},\n",
       " {'nineties.name': 'Reel Fishing'},\n",
       " {'nineties.name': 'Road Rash 3D'},\n",
       " {'nineties.name': \"Oddworld: Abe's Oddysee\"},\n",
       " {'nineties.name': 'Tetris 2 (All region sales)'},\n",
       " {'nineties.name': 'Vigilante 8'},\n",
       " {'nineties.name': 'Intelligent Qube'},\n",
       " {'nineties.name': 'Game & Watch Gallery 2'},\n",
       " {'nineties.name': 'Game & Watch Gallery 3'},\n",
       " {'nineties.name': 'NBA Live 99'},\n",
       " {'nineties.name': 'Chocobo no Fushigi Dungeon'},\n",
       " {'nineties.name': 'SimCity 2000'},\n",
       " {'nineties.name': 'WCW Mayhem'},\n",
       " {'nineties.name': 'The Magical Quest starring Mickey Mouse'},\n",
       " {'nineties.name': 'Star Wars Episode 1: Jedi Power Battles'},\n",
       " {'nineties.name': 'Test Drive 4'},\n",
       " {'nineties.name': 'Dragon Ball Z: La Legende Saien'},\n",
       " {'nineties.name': 'NFL 2K'},\n",
       " {'nineties.name': 'Nuclear Strike'},\n",
       " {'nineties.name': 'Kobe Bryant in NBA Courtside'},\n",
       " {'nineties.name': \"Disney's Chip 'n Dale: Rescue Rangers\"},\n",
       " {'nineties.name': 'The Dukes of Hazzard: Racing for Home'},\n",
       " {'nineties.name': 'Metal Gear Solid VR Missions'},\n",
       " {'nineties.name': 'Shenmue'},\n",
       " {'nineties.name': \"Super Ghouls 'n Ghosts\"},\n",
       " {'nineties.name': 'Soviet Strike'},\n",
       " {'nineties.name': 'Mega Man 3'},\n",
       " {'nineties.name': 'Mission: Impossible'},\n",
       " {'nineties.name': 'Romancing SaGa 2'},\n",
       " {'nineties.name': 'Cool Boarders 4'},\n",
       " {'nineties.name': 'Rage Racer'},\n",
       " {'nineties.name': 'Destruction Derby 2'},\n",
       " {'nineties.name': 'Bushido Blade'},\n",
       " {'nineties.name': 'Jet Force Gemini'},\n",
       " {'nineties.name': 'Mega Man X'},\n",
       " {'nineties.name': 'Sega Rally Championship'},\n",
       " {'nineties.name': 'Test Drive: Off Road'},\n",
       " {'nineties.name': 'Qix'},\n",
       " {'nineties.name': 'Derby Stallion III'},\n",
       " {'nineties.name': 'Dragon Quest I & II'},\n",
       " {'nineties.name': 'Asteroids'},\n",
       " {'nineties.name': 'Puyo Puyo Sun Ketteiban'},\n",
       " {'nineties.name': 'Brave Fencer Musashi'},\n",
       " {'nineties.name': 'South Park'},\n",
       " {'nineties.name': 'Pilotwings'},\n",
       " {'nineties.name': 'Super R.C. Pro-Am'},\n",
       " {'nineties.name': 'Derby Stallion 99'},\n",
       " {'nineties.name': \"Jampack Winter '98\"},\n",
       " {'nineties.name': 'Pilotwings 64'},\n",
       " {'nineties.name': \"Yoshi's Cookie\"},\n",
       " {'nineties.name': 'Arc the Lad'},\n",
       " {'nineties.name': 'NBA Jam Tournament Edition'},\n",
       " {'nineties.name': 'Legend of Mana'},\n",
       " {'nineties.name': 'Triple Play 98'},\n",
       " {'nineties.name': 'Yu-Gi-Oh! Duel Monsters II: Dark Duel Stories'},\n",
       " {'nineties.name': 'F-Zero X'},\n",
       " {'nineties.name': 'Star Ocean: The Second Story'},\n",
       " {'nineties.name': 'BeatMania'},\n",
       " {'nineties.name': 'Densha De Go!'},\n",
       " {'nineties.name': 'NFL Blitz 2000'},\n",
       " {'nineties.name': 'Ready 2 Rumble Boxing'},\n",
       " {'nineties.name': 'Doko Demo Issyo'},\n",
       " {'nineties.name': 'Virtua Fighter'},\n",
       " {'nineties.name': 'Championship Manager 99/00'},\n",
       " {'nineties.name': 'NHL 99'},\n",
       " {'nineties.name': 'Ridge Racer Revolution'},\n",
       " {'nineties.name': 'Hot Wheels Turbo Racing'},\n",
       " {'nineties.name': 'NCAA Football 99'},\n",
       " {'nineties.name': 'Simple 1500 Series Vol. 1: The Mahjong'},\n",
       " {'nineties.name': 'Worms Armageddon'},\n",
       " {'nineties.name': 'NFL Blitz'},\n",
       " {'nineties.name': 'NFL Quarterback Club 98'},\n",
       " {'nineties.name': 'Arc the Lad II'},\n",
       " {'nineties.name': 'Derby Stallion 96'},\n",
       " {'nineties.name': 'Monster Rancher 2'},\n",
       " {'nineties.name': 'Tales of Destiny'},\n",
       " {'nineties.name': 'Mega Man X4'},\n",
       " {'nineties.name': 'Bomberman 64'},\n",
       " {'nineties.name': 'Jeremy McGrath Supercross 98'},\n",
       " {'nineties.name': 'Tomb Raider'},\n",
       " {'nineties.name': 'Street Fighter Alpha 3'},\n",
       " {'nineties.name': 'Final Fight 2'},\n",
       " {'nineties.name': 'The Lost World: Jurassic Park'},\n",
       " {'nineties.name': 'Pong: The Next Level'},\n",
       " {'nineties.name': 'NBA Jam Tournament Edition'},\n",
       " {'nineties.name': 'Monster Rancher'},\n",
       " {'nineties.name': 'Breath of Fire III'},\n",
       " {'nineties.name': 'NES Open Tournament Golf'},\n",
       " {'nineties.name': 'Game & Watch Gallery'},\n",
       " {'nineties.name': 'Road & Track Presents: The Need for Speed'},\n",
       " {'nineties.name': 'NBA Live 97'},\n",
       " {'nineties.name': \"Oddworld: Abe's Exoddus\"},\n",
       " {'nineties.name': 'Tetris 2'},\n",
       " {'nineties.name': 'NASCAR 99'},\n",
       " {'nineties.name': 'Romancing SaGa'},\n",
       " {'nineties.name': \"Jampack Summer '99\"},\n",
       " {'nineties.name': 'Dance Dance Revolution 2nd ReMIX'},\n",
       " {'nineties.name': 'Mortal Kombat Trilogy'},\n",
       " {'nineties.name': 'Wild ARMs'},\n",
       " {'nineties.name': 'NCAA Football 2000'},\n",
       " {'nineties.name': \"Midway Presents Arcade's Greatest Hits: The Atari Collection 1\"},\n",
       " {'nineties.name': 'SaGa Frontier 2'},\n",
       " {'nineties.name': 'MLB 2000'},\n",
       " {'nineties.name': 'Mega Man 4'},\n",
       " {'nineties.name': 'Toy Story 2: Buzz Lightyear to the Rescue!'},\n",
       " {'nineties.name': 'SnoCross Championship Racing'},\n",
       " {'nineties.name': 'NHL 98'},\n",
       " {'nineties.name': 'Space Jam'},\n",
       " {'nineties.name': 'Knockout Kings 2000'},\n",
       " {'nineties.name': 'Tobal No.1'},\n",
       " {'nineties.name': 'Glover'},\n",
       " {'nineties.name': 'Super Momotarou Dentetsu III'},\n",
       " {'nineties.name': \"Mini-Yonku Shining Scorpion: Let's & Go!!\"},\n",
       " {'nineties.name': 'Destruction Derby'},\n",
       " {'nineties.name': '3Xtreme'},\n",
       " {'nineties.name': 'Madden NFL 99'},\n",
       " {'nineties.name': 'Ace Combat 2'},\n",
       " {'nineties.name': 'Seiken Densetsu 3'},\n",
       " {'nineties.name': \"Mega Man 8 Anniversary Collector's Edition\"},\n",
       " {'nineties.name': 'Star Wars: Rebel Assault II - The Hidden Empire'},\n",
       " {'nineties.name': 'Gex'},\n",
       " {'nineties.name': 'Derby Stallion II'},\n",
       " {'nineties.name': 'Need for Speed: V-Rally'},\n",
       " {'nineties.name': \"NFL GameDay '97\"},\n",
       " {'nineties.name': 'NHL 2000'},\n",
       " {'nineties.name': 'Madden Football 64'},\n",
       " {'nineties.name': 'MLB 99'},\n",
       " {'nineties.name': 'Army Men: Air Attack'},\n",
       " {'nineties.name': 'Street Fighter Alpha 2'},\n",
       " {'nineties.name': 'Rampage World Tour'},\n",
       " {'nineties.name': 'NFL GameDay'},\n",
       " {'nineties.name': 'Q*bert'},\n",
       " {'nineties.name': 'Ace Combat 3: Electrosphere'},\n",
       " {'nineties.name': 'The Game of Life'},\n",
       " {'nineties.name': 'Mega Man Legends'},\n",
       " {'nineties.name': 'MediEvil'},\n",
       " {'nineties.name': 'Casper'},\n",
       " {'nineties.name': 'Killer Instinct Gold'},\n",
       " {'nineties.name': 'Kamaitachi no Yoru'},\n",
       " {'nineties.name': 'Super Bomberman 2'},\n",
       " {'nineties.name': \"Jikkyou Powerful Pro Yakyuu '99 Kaimakuban\"},\n",
       " {'nineties.name': 'Valkyrie Profile'},\n",
       " {'nineties.name': \"Army Men: Sarge's Heroes\"},\n",
       " {'nineties.name': 'EarthBound'},\n",
       " {'nineties.name': 'The Next Tetris'},\n",
       " {'nineties.name': \"World Soccer Jikkyou Winning Eleven 3: World Cup France '98\"},\n",
       " {'nineties.name': 'Moto Racer'},\n",
       " {'nineties.name': 'Final Fantasy Anthology'},\n",
       " {'nineties.name': \"Capcom's Soccer Shootout\"},\n",
       " {'nineties.name': 'Ridge Racer'},\n",
       " {'nineties.name': 'Momotarou Dentetsu 7'},\n",
       " {'nineties.name': 'WCW Mayhem'},\n",
       " {'nineties.name': 'Mega Man 5'},\n",
       " {'nineties.name': 'Major League Baseball Featuring Ken Griffey Jr'},\n",
       " {'nineties.name': 'The 7th Guest'},\n",
       " {'nineties.name': 'Doom'},\n",
       " {'nineties.name': 'Marvel vs. Capcom: Clash of Super Heroes'},\n",
       " {'nineties.name': 'Battle Stations'},\n",
       " {'nineties.name': 'Torneko no Daibouken: Fushigi no Dungeon'},\n",
       " {'nineties.name': 'NBA ShootOut 98'},\n",
       " {'nineties.name': 'Andretti Racing'},\n",
       " {'nineties.name': 'Need for Speed: Porsche Unleashed'},\n",
       " {'nineties.name': 'Dragon Warrior I&II'},\n",
       " {'nineties.name': 'Formula 1'},\n",
       " {'nineties.name': \"Street Fighter Alpha: Warriors' Dreams\"},\n",
       " {'nineties.name': 'ISS Pro Evolution'},\n",
       " {'nineties.name': 'Final Fantasy Legend III'},\n",
       " {'nineties.name': 'San Francisco Rush: Extreme Racing'},\n",
       " {'nineties.name': 'Street Fighter EX Plus Alpha'},\n",
       " {'nineties.name': 'Jet Moto 3'},\n",
       " {'nineties.name': 'FIFA: Road to World Cup 98'},\n",
       " {'nineties.name': 'Dragon Ball Z: Ultime Menace'},\n",
       " {'nineties.name': 'Yoshi'},\n",
       " {'nineties.name': 'Mortal Kombat 4'},\n",
       " {'nineties.name': 'Croc 2'},\n",
       " {'nineties.name': 'SD Gundam G Generation'},\n",
       " {'nineties.name': 'Area 51'},\n",
       " {'nineties.name': 'Test Drive 6'},\n",
       " {'nineties.name': 'Fear Effect'},\n",
       " {'nineties.name': 'LEGO Racers'},\n",
       " {'nineties.name': 'WWF Attitude'},\n",
       " {'nineties.name': 'Blast Corps'},\n",
       " {'nineties.name': 'Tactics Ogre: Let Us Cling Together'},\n",
       " {'nineties.name': 'Battle Arena Toshinden 2'},\n",
       " {'nineties.name': 'Jeopardy!'},\n",
       " {'nineties.name': 'South Park'},\n",
       " {'nineties.name': 'Super Bomberman 3'},\n",
       " {'nineties.name': 'Command & Conquer: Red Alert Retaliation'},\n",
       " {'nineties.name': 'NCAA Football 98'},\n",
       " {'nineties.name': \"Chocobo's Dungeon 2\"},\n",
       " {'nineties.name': 'Fire Emblem: Monsh? no Nazo'},\n",
       " {'nineties.name': 'Moto Racer 2'},\n",
       " {'nineties.name': 'J-League Soccer: Prime Goal'},\n",
       " {'nineties.name': 'NFL Xtreme'},\n",
       " {'nineties.name': 'Star Wars: Masters of Teras Kasi'},\n",
       " {'nineties.name': 'Mortal Kombat Mythologies: Sub-Zero'},\n",
       " {'nineties.name': 'Bushido Blade 2'},\n",
       " {'nineties.name': 'Suikoden II'},\n",
       " {'nineties.name': 'Street Sk8er'},\n",
       " {'nineties.name': 'Contra: Legacy of War'},\n",
       " {'nineties.name': 'Spice World'},\n",
       " {'nineties.name': 'Wild ARMs 2'},\n",
       " {'nineties.name': 'Pro Pinball: Big Race USA'},\n",
       " {'nineties.name': 'Tiger Woods PGA Tour 2000'},\n",
       " {'nineties.name': 'Legend of Legaia'},\n",
       " {'nineties.name': 'Um Jammer Lammy'},\n",
       " {'nineties.name': 'Animaniacs Ten Pin Alley'},\n",
       " {'nineties.name': 'World of Dragon Warrior - Torneko: The Last Hope'},\n",
       " {'nineties.name': 'Centipede'},\n",
       " {'nineties.name': \"Tom Clancy's Rainbow Six\"},\n",
       " {'nineties.name': 'Castlevania'},\n",
       " {'nineties.name': 'Rayman 2: The Great Escape'},\n",
       " {'nineties.name': \"Cruis'n World\"},\n",
       " {'nineties.name': 'Nightmare Creatures'},\n",
       " {'nineties.name': 'Sim Theme Park'},\n",
       " {'nineties.name': \"A Bug's Life\"},\n",
       " {'nineties.name': 'Super Castlevania IV'},\n",
       " {'nineties.name': 'Final Fantasy VII International'},\n",
       " {'nineties.name': 'Nobunaga no Yabou: Haouden'},\n",
       " {'nineties.name': 'Virtua Cop'},\n",
       " {'nineties.name': 'WWF in Your House'},\n",
       " {'nineties.name': \"NBA ShootOut '97\"},\n",
       " {'nineties.name': 'Beetle Adventure Racing!'},\n",
       " {'nineties.name': 'Bass Landing'},\n",
       " {'nineties.name': \"Mario's Picross\"},\n",
       " {'nineties.name': 'Fighters MEGAMiX'},\n",
       " {'nineties.name': 'Bahamut Lagoon'},\n",
       " {'nineties.name': 'Tomb Raider III: Adventures of Lara Croft'},\n",
       " {'nineties.name': 'NFL Quarterback Club 99'},\n",
       " {'nineties.name': 'Small Soldiers'},\n",
       " {'nineties.name': 'Duke Nukem: Total Meltdown'},\n",
       " {'nineties.name': 'Tomb Raider Chronicles'},\n",
       " {'nineties.name': 'Madden NFL 2000'},\n",
       " {'nineties.name': 'Suikoden'},\n",
       " {'nineties.name': 'Puyo Puyo Sun'},\n",
       " {'nineties.name': 'International Superstar Soccer 64'},\n",
       " {'nineties.name': 'BeatMania Append 3rdMix'},\n",
       " {'nineties.name': 'Xena: Warrior Princess'},\n",
       " {'nineties.name': 'Front Mission'},\n",
       " {'nineties.name': \"Jikkyou Powerful Pro Yakyuu '97 Kaimakuban\"},\n",
       " {'nineties.name': 'CyberTiger'},\n",
       " {'nineties.name': \"Jikkyou Powerful Pro Yakyuu '98 Kaimakuban\"},\n",
       " {'nineties.name': 'Extreme-G'},\n",
       " {'nineties.name': 'Ready 2 Rumble Boxing'},\n",
       " {'nineties.name': 'Barbie: Race & Ride'},\n",
       " {'nineties.name': \"Kirby's Dream Course\"},\n",
       " {'nineties.name': 'Tokimeki Memorial: Forever with You'},\n",
       " {'nineties.name': 'Diablo'},\n",
       " {'nineties.name': 'FIFA: Road to  World Cup 98'},\n",
       " {'nineties.name': 'World Cup 98'},\n",
       " {'nineties.name': \"International Superstar Soccer '98\"},\n",
       " {'nineties.name': 'Tales of Phantasia'},\n",
       " {'nineties.name': 'Gex: Enter the Gecko'},\n",
       " {'nineties.name': 'Championship Motocross featuring Ricky Carmichael'},\n",
       " {'nineties.name': 'Dragon Ball Z: Chou Saiya Densetsu'},\n",
       " {'nineties.name': 'Fire Emblem: Seisen no Keifu'},\n",
       " {'nineties.name': 'Parasite Eve II'},\n",
       " {'nineties.name': 'NFL Blitz 2000'},\n",
       " {'nineties.name': 'Theme Park'},\n",
       " {'nineties.name': 'Beyond The Beyond'},\n",
       " {'nineties.name': 'NBA Hangtime'},\n",
       " {'nineties.name': 'Super Bomberman'},\n",
       " {'nineties.name': \"Army Men: Sarge's Heroes\"},\n",
       " {'nineties.name': 'Resident Evil 2'},\n",
       " {'nineties.name': 'Mega Man X2'},\n",
       " {'nineties.name': 'Fatal Fury Special'},\n",
       " {'nineties.name': 'Lunar: Silver Star Story Complete'},\n",
       " {'nineties.name': 'NBA Showtime: NBA on NBC'},\n",
       " {'nineties.name': 'Daytona USA'},\n",
       " {'nineties.name': 'Shin Super Robot Taisen'},\n",
       " {'nineties.name': 'Fighting Force 2'},\n",
       " {'nineties.name': 'Sakura Wars'},\n",
       " {'nineties.name': 'Star Wars: Dark Forces'},\n",
       " {'nineties.name': 'SD Gundam G Generation Zero'},\n",
       " {'nineties.name': 'Super Robot Taisen F'},\n",
       " {'nineties.name': 'Super Robot Taisen F Kanketsuhen'},\n",
       " {'nineties.name': 'Mortal Kombat 3'},\n",
       " {'nineties.name': 'Top Gun: Fire at Will!'},\n",
       " {'nineties.name': 'Medarot 2: Kabuto / Kuwagata Version'},\n",
       " {'nineties.name': 'Gauntlet Legends'},\n",
       " {'nineties.name': 'FIFA 99'},\n",
       " {'nineties.name': 'Bust A Groove'},\n",
       " {'nineties.name': 'Pachi-Slot Aruze Oukoku 2'},\n",
       " {'nineties.name': 'Sakura Taisen 2 - Kimi, Shinitamou Koto Nakare'},\n",
       " {'nineties.name': 'Clock Tower'},\n",
       " {'nineties.name': 'Gex 3: Deep Cover Gecko'},\n",
       " {'nineties.name': 'Jampack Vol. 2'},\n",
       " {'nineties.name': 'Virtual Soccer'},\n",
       " {'nineties.name': 'Romance of the Three Kingdoms IV: Wall of Fire'},\n",
       " {'nineties.name': 'Winning Post'},\n",
       " {'nineties.name': 'Front Mission 2'},\n",
       " {'nineties.name': 'J-League Soccer: Prime Goal 2'},\n",
       " {'nineties.name': 'NASCAR 2000'},\n",
       " {'nineties.name': \"Wayne Gretzky's 3D Hockey\"},\n",
       " {'nineties.name': 'Seaman'},\n",
       " {'nineties.name': 'The Grinch'},\n",
       " {'nineties.name': 'Mega Man 6'},\n",
       " {'nineties.name': 'Mission: Impossible'},\n",
       " {'nineties.name': 'Rival Schools: United By Fate'},\n",
       " {'nineties.name': 'Front Mission 3'},\n",
       " {'nineties.name': 'Omega Boost'},\n",
       " {'nineties.name': 'International Track & Field'},\n",
       " {'nineties.name': 'Virtual Pool'},\n",
       " {'nineties.name': 'Rugrats: Scavenger Hunt'},\n",
       " {'nineties.name': 'International Superstar Soccer 2000 (All region sales)'},\n",
       " {'nineties.name': 'Dai-4-Ji Super Robot Taisen S'},\n",
       " {'nineties.name': 'NHL FaceOff 98'},\n",
       " {'nineties.name': \"Bases Loaded '96: Double Header\"},\n",
       " {'nineties.name': 'RPG Maker'},\n",
       " {'nineties.name': 'Super Famista 5'},\n",
       " {'nineties.name': 'PoPoLoCrois Monogatari'},\n",
       " {'nineties.name': 'Mario & Wario'},\n",
       " {'nineties.name': 'FIFA Soccer 64'},\n",
       " {'nineties.name': 'J-League Pro Soccer Club wo Tsukurou! 2'},\n",
       " {'nineties.name': 'Die Hard Trilogy 2: Viva Las Vegas'},\n",
       " {'nineties.name': 'SimCity 2000'},\n",
       " {'nineties.name': 'Yu-Gi-Oh! Forbidden Memories (JP sales)'},\n",
       " {'nineties.name': 'The Legend of the Mystical Ninja'},\n",
       " {'nineties.name': 'ECW Hardcore Revolution'},\n",
       " {'nineties.name': 'Wu-Tang: Shaolin Style'},\n",
       " {'nineties.name': 'All-Star Baseball 99'},\n",
       " {'nineties.name': 'Harvest Moon 64'},\n",
       " {'nineties.name': 'Vigilante 8: 2nd Offense'},\n",
       " {'nineties.name': 'NFL Xtreme 2'},\n",
       " {'nineties.name': 'Alien Trilogy'},\n",
       " {'nineties.name': 'NBA Live 99'},\n",
       " {'nineties.name': 'Super Puyo Puyo 2'},\n",
       " {'nineties.name': 'WipEout'},\n",
       " {'nineties.name': 'Bomberman Hero'},\n",
       " {'nineties.name': 'Automobili Lamborghini'},\n",
       " {'nineties.name': 'Quest 64'},\n",
       " {'nineties.name': 'Momotarou Dentetsu V'},\n",
       " {'nineties.name': 'Doom 64'},\n",
       " {'nineties.name': 'MTV Music Generator'},\n",
       " {'nineties.name': 'Super Momotarou Dentetsu DX'},\n",
       " {'nineties.name': 'NHL 97'},\n",
       " {'nineties.name': 'Razor Freestyle Scooter'},\n",
       " {'nineties.name': 'Super Batter Up'},\n",
       " {'nineties.name': 'Crayon Shin-Chan: Arashi o Yobu Enji'},\n",
       " {'nineties.name': 'Hydro Thunder'},\n",
       " {'nineties.name': \"NHL FaceOff '97\"},\n",
       " {'nineties.name': 'Bloody Roar II'},\n",
       " {'nineties.name': 'Space Invaders'},\n",
       " {'nineties.name': 'Warhawk'},\n",
       " {'nineties.name': 'Missile Command'},\n",
       " {'nineties.name': 'Jikkyou Powerful Pro Yakyuu 3'},\n",
       " {'nineties.name': \"J-League Excite Stage '95\"},\n",
       " {'nineties.name': 'NCAA Gamebreaker 99'},\n",
       " {'nineties.name': 'World Stadium 2'},\n",
       " {'nineties.name': 'Apocalypse'},\n",
       " {'nineties.name': 'Fatal Fury 2'},\n",
       " {'nineties.name': 'Rampage World Tour'},\n",
       " {'nineties.name': 'Persona'},\n",
       " {'nineties.name': 'Mobile Suit Gundam'},\n",
       " {'nineties.name': 'Final Fantasy Collection'},\n",
       " {'nineties.name': 'NHL FaceOff'},\n",
       " {'nineties.name': 'Vandal Hearts'},\n",
       " {'nineties.name': 'NBA Live 2000'},\n",
       " {'nineties.name': 'World Stadium EX'},\n",
       " {'nineties.name': 'Independence Day'},\n",
       " {'nineties.name': 'Chocobo Racing'},\n",
       " {'nineties.name': 'Blood Omen: Legacy of Kain'},\n",
       " {'nineties.name': 'Super Bomberman 4'},\n",
       " {'nineties.name': 'Bomberman II'},\n",
       " {'nineties.name': 'Duke Nukem 64'},\n",
       " {'nineties.name': 'Neon Genesis Evangelion'},\n",
       " {'nineties.name': 'NiGHTS into dreams...'},\n",
       " {'nineties.name': 'Wonder Project J: Kikai no Shonen Pino'},\n",
       " {'nineties.name': 'WipEout 64'},\n",
       " {'nineties.name': 'Mischief Makers'},\n",
       " {'nineties.name': 'Cool Boarders'},\n",
       " {'nineties.name': 'NHL FaceOff 99'},\n",
       " {'nineties.name': 'Neon Genesis Evangelion 2nd Impression'},\n",
       " {'nineties.name': 'The X Files'},\n",
       " {'nineties.name': 'Super Wagyan Land'},\n",
       " {'nineties.name': 'Rascal'},\n",
       " {'nineties.name': 'Colony Wars'},\n",
       " {'nineties.name': 'Grandia'},\n",
       " {'nineties.name': 'JGTC: All-Japan Grand Touring Car Championship'},\n",
       " {'nineties.name': 'Arc the Lad III'},\n",
       " {'nineties.name': 'Rush 2: Extreme Racing USA'},\n",
       " {'nineties.name': 'Jikkyou Powerful Pro Yakyuu 6'},\n",
       " {'nineties.name': 'Super Famista 4'},\n",
       " {'nineties.name': \"International Superstar Soccer Pro '98\"},\n",
       " {'nineties.name': 'X-Men vs. Street Fighter'},\n",
       " {'nineties.name': 'Cyber Troopers Virtual-On'},\n",
       " {'nineties.name': 'Tomb Raider: The Last Revelation'},\n",
       " {'nineties.name': 'Sega Rally Championship 2'},\n",
       " {'nineties.name': 'Quake II'},\n",
       " {'nineties.name': 'Grudge Warriors'},\n",
       " {'nineties.name': 'Mobile Suit Gundam'},\n",
       " {'nineties.name': 'E0: Enemy Zero'},\n",
       " {'nineties.name': 'NASCAR Racing'},\n",
       " {'nineties.name': 'Command & Conquer: Red Alert'},\n",
       " {'nineties.name': 'Ogre Battle 64: Person of Lordly Caliber'},\n",
       " {'nineties.name': 'Superman: The New Superman Adventures'},\n",
       " {'nineties.name': 'Armored Core'},\n",
       " {'nineties.name': 'Densha De Go! 2'},\n",
       " {'nineties.name': 'Pro Pinball'},\n",
       " {'nineties.name': \"'98 Koshien\"},\n",
       " {'nineties.name': 'Mario no Super Picross'},\n",
       " {'nineties.name': \"Jikkyou Powerful Pro Yakuu '94\"},\n",
       " {'nineties.name': 'Medarot: Kabuto / Kuwagata Version'},\n",
       " {'nineties.name': 'Pet in TV'},\n",
       " {'nineties.name': 'NBA ShootOut 2000'},\n",
       " {'nineties.name': 'Samurai Shodown'},\n",
       " {'nineties.name': 'Fighting Vipers'},\n",
       " {'nineties.name': 'NCAA GameBreaker 2000'},\n",
       " {'nineties.name': 'RR64: Ridge Racer 64'},\n",
       " {'nineties.name': 'Top Gear Rally'},\n",
       " {'nineties.name': 'NFL Quarterback Club 2000'},\n",
       " {'nineties.name': 'Mortal Kombat Mythologies: Sub-Zero'},\n",
       " {'nineties.name': 'Bugs Bunny: Lost in Time'},\n",
       " {'nineties.name': 'Road Rash: Jailbreak'},\n",
       " {'nineties.name': \"You Don't Know Jack\"},\n",
       " {'nineties.name': 'Mystery Dungeon: Shiren the Wanderer'},\n",
       " {'nineties.name': 'Command & Conquer'},\n",
       " {'nineties.name': 'Tales of Phantasia'},\n",
       " {'nineties.name': 'NHL 99'},\n",
       " {'nineties.name': 'Bloody Roar'},\n",
       " {'nineties.name': 'Thrasher Presents: Skate and Destroy'},\n",
       " {'nineties.name': 'All-Star Baseball 2000'},\n",
       " {'nineties.name': 'Extreme-G: XG2'},\n",
       " {'nineties.name': 'BattleTanx: Global Assault'},\n",
       " {'nineties.name': 'Super Fire ProWrestling'},\n",
       " {'nineties.name': 'Fatal Fury'},\n",
       " {'nineties.name': 'Super Famista 3'},\n",
       " {'nineties.name': 'Tokimeki Memorial 2'},\n",
       " {'nineties.name': 'Triple Play 97'},\n",
       " {'nineties.name': 'Super Soccer'},\n",
       " {'nineties.name': 'Wario Land II (GBC)'},\n",
       " {'nineties.name': 'San Francisco Rush: Extreme Racing'},\n",
       " {'nineties.name': 'Bakusou Dekotora Densetsu: Otoko Ippiki Yume Kaidoi'},\n",
       " {'nineties.name': 'Shin Megami Tensei: Devil Summoner'},\n",
       " {'nineties.name': 'ESPN Extreme Games'},\n",
       " {'nineties.name': 'Ninja: Shadow of Darkness'},\n",
       " {'nineties.name': 'Mobile Suit Gundam version 2.0'},\n",
       " {'nineties.name': 'Final Fantasy Adventure'},\n",
       " {'nineties.name': 'Tokimeki Memorial: Forever with You'},\n",
       " {'nineties.name': 'MediEvil II'},\n",
       " {'nineties.name': 'Rogue Trip: Vacation 2012'},\n",
       " {'nineties.name': 'Dai-4-Ji Super Robot Taisen'},\n",
       " {'nineties.name': 'NCAA Final Four 2000'},\n",
       " {'nineties.name': 'Tobal 2'},\n",
       " {'nineties.name': 'Kileak: The DNA Imperative'},\n",
       " {'nineties.name': 'Super Formation Soccer 94'},\n",
       " {'nineties.name': 'Panzer Dragoon'},\n",
       " {'nineties.name': 'Yarudora Series Vol.1: Double Cast'},\n",
       " {'nineties.name': 'Turok: Rage Wars'},\n",
       " {'nineties.name': 'Super Robot Taisen EX'},\n",
       " {'nineties.name': 'Bottom of the 9th'},\n",
       " {'nineties.name': 'Shin Megami Tensei II'},\n",
       " {'nineties.name': 'Virtua Fighter 3tb'},\n",
       " {'nineties.name': \"Mini-Yonku GB: Let's & Go!!\"},\n",
       " {'nineties.name': 'Zero4 Champ RR'},\n",
       " {'nineties.name': 'Nonomura Byoin no Hitobito'},\n",
       " {'nineties.name': 'Super Fire ProWrestling Special'},\n",
       " {'nineties.name': 'Yuu Yuu Hakusho'},\n",
       " {'nineties.name': 'MechWarrior 2: 31st Century Combat'},\n",
       " {'nineties.name': 'Mobile Suit Z-Gundam'},\n",
       " {'nineties.name': \"Kirby's Dream Land 3\"},\n",
       " {'nineties.name': 'Big Bass World Championship'},\n",
       " {'nineties.name': 'Jurassic Park'},\n",
       " {'nineties.name': 'Mystical Ninja starring Goemon'},\n",
       " {'nineties.name': 'Tetrisphere'},\n",
       " {'nineties.name': 'Breath of Fire II'},\n",
       " {'nineties.name': 'LEGO Racers'},\n",
       " {'nineties.name': \"Boxer's Road\"},\n",
       " {'nineties.name': 'South Park Rally'},\n",
       " {'nineties.name': 'Ganbare Goemon 3: Shishi Jyuurokubei no Karakuri Manji Katame'},\n",
       " {'nineties.name': 'J-League Pro Soccer Club o Tsukurou!'},\n",
       " {'nineties.name': 'Formula 1 Championship Edition'},\n",
       " {'nineties.name': 'Blasto'},\n",
       " {'nineties.name': 'Picross 2'},\n",
       " {'nineties.name': 'Mega Man X3'},\n",
       " {'nineties.name': 'Stunt Race FX'},\n",
       " {'nineties.name': 'Rally Cross 2'},\n",
       " {'nineties.name': 'Lunar 2: Eternal Blue Complete'},\n",
       " {'nineties.name': \"Street Fighter Alpha: Warriors' Dreams\"},\n",
       " {'nineties.name': 'Kurushi Final: Mental Blocks'},\n",
       " {'nineties.name': 'SoulCalibur'},\n",
       " {'nineties.name': 'WipEout 3'},\n",
       " {'nineties.name': 'Iron Storm'},\n",
       " {'nineties.name': 'Marvel Super Heroes'},\n",
       " {'nineties.name': \"Night Warriors: Darkstalkers' Revenge\"},\n",
       " {'nineties.name': 'Off Road Challenge'},\n",
       " {'nineties.name': 'Backstreet Billiards'},\n",
       " {'nineties.name': 'Point Blank'},\n",
       " {'nineties.name': 'Tiny Tank'},\n",
       " {'nineties.name': 'Fade to Black'},\n",
       " {'nineties.name': 'Tokyo Highway Battle'},\n",
       " {'nineties.name': 'Bomberman World'},\n",
       " {'nineties.name': 'Deathtrap Dungeon'},\n",
       " {'nineties.name': 'BeatMania Append GottaMix'},\n",
       " {'nineties.name': 'World Stadium 3'},\n",
       " {'nineties.name': 'Extra Bases'},\n",
       " {'nineties.name': 'Super Power League 2'},\n",
       " {'nineties.name': 'BattleTanx'},\n",
       " {'nineties.name': 'Pitfall 3D: Beyond the Jungle'},\n",
       " {'nineties.name': 'Battle Dodge Ball'},\n",
       " {'nineties.name': 'Parodius'},\n",
       " {'nineties.name': 'Kidou Senshi Gundam F91: Formula Senki 0122'},\n",
       " {'nineties.name': 'DX Game of Life 2'},\n",
       " {'nineties.name': 'NBA Live 96'},\n",
       " {'nineties.name': 'Shin Nippon Pro Wrestling: Toukon Retsuden'},\n",
       " {'nineties.name': 'Championship Bass'},\n",
       " {'nineties.name': 'NHL Breakaway 98'},\n",
       " {'nineties.name': \"Bust-A-Move '99\"},\n",
       " {'nineties.name': 'OverBlood'},\n",
       " {'nineties.name': 'ESPN X-Games Pro Boarder'},\n",
       " {'nineties.name': 'Harvest Moon: Back to Nature'},\n",
       " {'nineties.name': 'Nagano Winter Olympics 98'},\n",
       " {'nineties.name': \"Kirby's Block Ball\"},\n",
       " {'nineties.name': 'Rally Cross'},\n",
       " {'nineties.name': 'Extreme Pinball'},\n",
       " {'nineties.name': 'Street Fighter Alpha 2'},\n",
       " {'nineties.name': 'No.1 Muscle Ranking - Kinniku Banzuke Vol. 1: Oregasaikyouno Otokoda!'},\n",
       " {'nineties.name': 'Tetris 2 + Bombliss'},\n",
       " {'nineties.name': 'Riven: The Sequel to Myst'},\n",
       " {'nineties.name': 'Shin Momotarou Densetsu'},\n",
       " {'nineties.name': 'The Conveni: Ano Machi wo Dokusen Seyo'},\n",
       " {'nineties.name': 'Shin Super Robot Taisen Special Disk'},\n",
       " {'nineties.name': 'Live A Live'},\n",
       " {'nineties.name': 'Momotarou Dentetsu Happy'},\n",
       " {'nineties.name': 'Heart of Darkness'},\n",
       " {'nineties.name': 'Virtua Striker 2'},\n",
       " {'nineties.name': 'WarCraft II: The Dark Saga'},\n",
       " {'nineties.name': 'NBA ShootOut'},\n",
       " {'nineties.name': 'Ganbare Goemon: KiraKira Douchuu - Boku ga Dancer ni Natta Riyuu'},\n",
       " {'nineties.name': 'Mario Golf'},\n",
       " {'nineties.name': \"Sesame Street: Elmo's Letter Adventure\"},\n",
       " {'nineties.name': \"Alone in the Dark: One-Eyed Jack's Revenge\"},\n",
       " {'nineties.name': 'Einhänder'},\n",
       " {'nineties.name': 'Tiny Toon Adventures: The Great Beanstalk'},\n",
       " {'nineties.name': 'Panzer Dragoon II Zwei'},\n",
       " {'nineties.name': 'Super Robot Taisen Complete Box'},\n",
       " {'nineties.name': 'Jikkyou Powerful Pro Yakyuu 4'},\n",
       " {'nineties.name': \"Goemon's Great Adventure\"},\n",
       " {'nineties.name': 'Hot Wheels Turbo Racing'},\n",
       " {'nineties.name': 'Vigilante 8'},\n",
       " {'nineties.name': 'Bass Hunter 64'},\n",
       " {'nineties.name': 'Shin Megami Tensei: Devil Summoner - Soul Hackers'},\n",
       " {'nineties.name': 'Demolition Racer'},\n",
       " {'nineties.name': 'Final Fantasy IV'},\n",
       " {'nineties.name': 'NHL FaceOff 2000'},\n",
       " {'nineties.name': \"South Park: Chef's Luv Shack\"},\n",
       " {'nineties.name': 'Ganbare Goemon 2: Kiteretsu Shougun Magginesu'},\n",
       " {'nineties.name': '40 Winks'},\n",
       " {'nineties.name': 'A Collection of Classic Games from the Intellivision'},\n",
       " {'nineties.name': 'RPG Tsukuru 2'},\n",
       " {'nineties.name': 'Yuu Yuu Hakusho 2: Kakutou no Sho'},\n",
       " {'nineties.name': 'Gameboy Gallery'},\n",
       " {'nineties.name': 'Virtua Cop 2'},\n",
       " {'nineties.name': 'Ehrgeiz'},\n",
       " {'nineties.name': 'Jumping Flash!'},\n",
       " {'nineties.name': 'Blazing Heroes'},\n",
       " {'nineties.name': 'Cart World Series'},\n",
       " {'nineties.name': \"Famista '91\"},\n",
       " {'nineties.name': 'Decathlete'},\n",
       " {'nineties.name': 'Daikaijyuu Monogatari'},\n",
       " {'nineties.name': 'Monster Truck Madness 64'},\n",
       " {'nineties.name': 'Quake II'},\n",
       " {'nineties.name': 'Macross Digital Mission VF-X'},\n",
       " {'nineties.name': 'Super Bomberman 5'},\n",
       " {'nineties.name': 'Dragon Force'},\n",
       " {'nineties.name': 'Winning Post 2'},\n",
       " {'nineties.name': 'Star Gladiator Episode: I Final Crusade'},\n",
       " {'nineties.name': 'Far East of Eden Zero'},\n",
       " {'nineties.name': 'Future Cop L.A.P.D.'},\n",
       " {'nineties.name': 'Hamster Tarou'},\n",
       " {'nineties.name': 'Guardian Heroes'},\n",
       " {'nineties.name': \"Fisherman's Bait 2: Big Ol' Bass\"},\n",
       " {'nineties.name': 'Kagero: Deception II'},\n",
       " {'nineties.name': \"J-League Victory Goal '96\"},\n",
       " {'nineties.name': 'SD Gundam G Century'},\n",
       " {'nineties.name': 'Itadaki Street 2: Neon Sign wa Bara Iro ni'},\n",
       " {'nineties.name': 'Viz'},\n",
       " {'nineties.name': 'Top Gear Overdrive'},\n",
       " {'nineties.name': 'Xena: Warrior Princess - The Talisman of Fate'},\n",
       " {'nineties.name': 'Jeremy McGrath Supercross 2000'},\n",
       " {'nineties.name': 'The New Tetris'},\n",
       " {'nineties.name': \"Ken Griffey Jr.'s Slugfest\"},\n",
       " {'nineties.name': 'Supercross 2000'},\n",
       " {'nineties.name': 'War Gods'},\n",
       " {'nineties.name': 'DX Game of Life'},\n",
       " {'nineties.name': 'MLB Pennant Race'},\n",
       " {'nineties.name': 'SD Gundam Gaiden: Knight Gundam Monogatari: Ooinaru Isan'},\n",
       " {'nineties.name': 'Namco Museum Vol.2'},\n",
       " {'nineties.name': 'Tomba! 2: The Evil Swine Return'},\n",
       " {'nineties.name': 'BeatMania Append 4thMix: The beat goes on'},\n",
       " {'nineties.name': 'Romance of the Three Kingdoms III: Dragon of Destiny'},\n",
       " {'nineties.name': 'PGA Tour 97'},\n",
       " {'nineties.name': 'VMX Racing'},\n",
       " {'nineties.name': 'Super Fire ProWrestling X'},\n",
       " {'nineties.name': 'International Superstar Soccer'},\n",
       " {'nineties.name': 'Digimon Adventure: Anode Tamer'},\n",
       " {'nineties.name': \"The King of Fighters '95\"},\n",
       " {'nineties.name': 'Triple Play 2000'},\n",
       " {'nineties.name': \"Mega Man: Dr. Wily's Revenge\"},\n",
       " {'nineties.name': \"Famista '92\"},\n",
       " {'nineties.name': 'Mega Man II'},\n",
       " {'nineties.name': 'Lord of Darkness'},\n",
       " {'nineties.name': 'Dead or Alive'},\n",
       " {'nineties.name': 'Mega Man 7'},\n",
       " {'nineties.name': 'NBA In The Zone'},\n",
       " {'nineties.name': 'F1 ROC: Race of Champions'},\n",
       " {'nineties.name': 'Kakyuusei'},\n",
       " {'nineties.name': 'Civilization II'},\n",
       " {'nineties.name': 'F-1 Grand Prix'},\n",
       " {'nineties.name': 'SimCity 2000'},\n",
       " {'nineties.name': 'Yu-Gi-Oh! Monster Capsule Breed & Battle'},\n",
       " {'nineties.name': 'Warpath: Jurassic Park'},\n",
       " {'nineties.name': 'Mobile Suit Gundam Side Story I: Senritsu no Blue'},\n",
       " {'nineties.name': 'Armored Core: Project Phantasma'},\n",
       " {'nineties.name': 'Nichibutsu Arcade Classics'},\n",
       " {'nineties.name': 'Shin Nippon Pro Wrestling: Toukon Retsuden 2'},\n",
       " {'nineties.name': 'Resident Evil 2: Dual Shock Edition'},\n",
       " {'nineties.name': 'Dynasty Warriors'},\n",
       " {'nineties.name': 'Dragon Ball GT: Final Bout'},\n",
       " {'nineties.name': 'Gunship'},\n",
       " {'nineties.name': 'Bishoujo Senshi Sailormoon R'},\n",
       " {'nineties.name': 'Slam Dunk: Yonkyo Taiketsu!!'},\n",
       " {'nineties.name': 'Fushigi no Dungeon: Fuurai no Shiren GB: Tsukikagemura no Kaibutsu'},\n",
       " {'nineties.name': \"NBA In The Zone '98\"},\n",
       " {'nineties.name': 'Jikkyou Powerful Pro Yakyuu 5'},\n",
       " {'nineties.name': 'NBA Jam 99'},\n",
       " {'nineties.name': 'Shadow Man'},\n",
       " {'nineties.name': 'Command & Conquer'},\n",
       " {'nineties.name': 'Jikkyou Powerful Pro Yakyuu 2'},\n",
       " {'nineties.name': 'Thoroughbred Breeder II'},\n",
       " {'nineties.name': 'Superbike 2000'},\n",
       " {'nineties.name': 'Alundra 2: A New Legend Begins'},\n",
       " {'nineties.name': \"Jikkyou Powerful Pro Yakyuu '98 Ketteiban\"},\n",
       " {'nineties.name': 'Final Doom'},\n",
       " {'nineties.name': 'Battle Arena Toshinden 3'},\n",
       " {'nineties.name': 'Jade Cocoon: Story of the Tamamayu'},\n",
       " {'nineties.name': 'Super Nazo Puyo: Ruruu no Ruu'},\n",
       " {'nineties.name': 'Gallop Racer 2: One and Only Road to Victory'},\n",
       " {'nineties.name': 'The House of the Dead 2'},\n",
       " {'nineties.name': \"Jikkyou Powerful Pro Yakyuu '99 Ketteiban\"},\n",
       " {'nineties.name': \"King's Field II\"},\n",
       " {'nineties.name': 'NCAA Gamebreaker'},\n",
       " {'nineties.name': 'Tomba!'},\n",
       " {'nineties.name': 'Virtua Racing'},\n",
       " {'nineties.name': 'Bust A Groove 2'},\n",
       " {'nineties.name': 'Nightmare Creatures'},\n",
       " {'nineties.name': 'Duke Nukem: Zero Hour'},\n",
       " {'nineties.name': 'Armorines: Project S.W.A.R.M.'},\n",
       " {'nineties.name': 'X-Men vs. Street Fighter'},\n",
       " {'nineties.name': 'Marvel Super Heroes vs. Street Fighter'},\n",
       " {'nineties.name': 'J-League Pro Soccer Club wo Tsukurou!'},\n",
       " {'nineties.name': 'Choro Q3'},\n",
       " {'nineties.name': 'Armored Core: Master of Arena'},\n",
       " {'nineties.name': 'Fire Emblem: Thracia 776'},\n",
       " {'nineties.name': 'Tengai Makyou: Daishi no Mokushiroku - The Apocalypse IV'},\n",
       " {'nineties.name': 'NHL Rock the Rink'},\n",
       " {'nineties.name': 'Doukyuusei if'},\n",
       " {'nineties.name': 'Combination Pro Soccer: J-League no Kantoku ni Natte Sekai wo Mezase!!'},\n",
       " {'nineties.name': 'Kidou Senshi Gundam: Giren no Yabou'},\n",
       " {'nineties.name': 'Crusaders of Might and Magic'},\n",
       " {'nineties.name': 'Romance of the Three Kingdoms II'},\n",
       " {'nineties.name': 'Galactic Attack'},\n",
       " {'nineties.name': 'Evil Zone'},\n",
       " {'nineties.name': 'A. IV Evolution: A Ressha de Ikou 4'},\n",
       " {'nineties.name': 'Scrabble'},\n",
       " {'nineties.name': 'WipEout XL'},\n",
       " {'nineties.name': 'Marie no Atelier: Salburg no Renkinjutsushi'},\n",
       " {'nineties.name': 'Samurai Shodown II'},\n",
       " {'nineties.name': 'Hybrid Heaven'},\n",
       " {'nineties.name': 'NBA Showtime: NBA on NBC'},\n",
       " {'nineties.name': \"Fox Sports College Hoops '99\"},\n",
       " {'nineties.name': 'Wheel of Fortune'},\n",
       " {'nineties.name': 'MRC: Multi-Racing Championship'},\n",
       " {'nineties.name': 'F1 Pole Position 64'},\n",
       " {'nineties.name': 'Gex 64: Enter the Gecko'},\n",
       " {'nineties.name': \"Wayne Gretzky's 3D Hockey '98\"},\n",
       " {'nineties.name': 'NBA Courtside 2 featuring Kobe Bryant'},\n",
       " {'nineties.name': 'Penny Racers'},\n",
       " {'nineties.name': 'Caesars Palace II'},\n",
       " {'nineties.name': 'Pro Yakyuu Team o Tsukurou!'},\n",
       " {'nineties.name': 'Sentimental Graffiti'},\n",
       " {'nineties.name': 'NBA Jam Tournament Edition'},\n",
       " {'nineties.name': 'Shadow Man'},\n",
       " {'nineties.name': 'Grandia'},\n",
       " {'nineties.name': 'Dune 2000'},\n",
       " {'nineties.name': 'Project Overkill'},\n",
       " {'nineties.name': 'Jumping Flash! 2'},\n",
       " {'nineties.name': 'Choro Q2'},\n",
       " {'nineties.name': 'Panzer General'},\n",
       " {'nineties.name': 'Gallop Racer (JP)'},\n",
       " {'nineties.name': 'Spawn the Eternal'},\n",
       " {'nineties.name': 'Guitar Freaks'},\n",
       " {'nineties.name': 'Namco Tennis Smash Court'},\n",
       " {'nineties.name': 'K-1 Revenge'},\n",
       " {'nineties.name': 'G-Police'},\n",
       " {'nineties.name': 'Paperboy'},\n",
       " {'nineties.name': \"South Park: Chef's Luv Shack\"},\n",
       " {'nineties.name': 'Road Rash 64'},\n",
       " {'nineties.name': 'Lucky Luke'},\n",
       " {'nineties.name': 'Forsaken'},\n",
       " {'nineties.name': 'Front Mission: Gun Hazard'},\n",
       " {'nineties.name': 'Wild 9'},\n",
       " {'nineties.name': 'PGA Tour 96'},\n",
       " {'nineties.name': \"Sesame Street: Elmo's Number Journey\"},\n",
       " {'nineties.name': 'Street Fighter EX2 Plus'},\n",
       " {'nineties.name': 'Pro Yakyuu Team o Tsukurou!'},\n",
       " {'nineties.name': 'Harvest Moon GB'},\n",
       " {'nineties.name': 'Gundam Battle Assault'},\n",
       " {'nineties.name': 'Virtua Fighter Kids'},\n",
       " {'nineties.name': 'Lunar: Silver Star Story'},\n",
       " {'nineties.name': 'Colony Wars: Vengeance'},\n",
       " {'nineties.name': \"The King of Fighters '95 (CD)\"},\n",
       " {'nineties.name': 'Perfect Weapon'},\n",
       " {'nineties.name': 'Tetris 2 (weekly jp sales)'},\n",
       " {'nineties.name': 'Critical Depth'},\n",
       " {'nineties.name': 'Star Ocean'},\n",
       " {'nineties.name': 'Alundra'},\n",
       " {'nineties.name': 'Super R-Type'},\n",
       " {'nineties.name': 'Rampage 2: Universal Tour'},\n",
       " {'nineties.name': 'Super Robot Taisen F Kanketsuhen'},\n",
       " {'nineties.name': 'The Raiden Project'},\n",
       " {'nineties.name': 'Pocket Fighter'},\n",
       " {'nineties.name': 'Tetris Attack'},\n",
       " {'nineties.name': 'Shin Nippon Pro Wrestling: Toukon Retsuden 3'},\n",
       " {'nineties.name': 'Jersey Devil'},\n",
       " {'nineties.name': '64 de Hakken! Tamagotchi Minna de Tamagotchi World'},\n",
       " {'nineties.name': 'Super Adventure Island'},\n",
       " {'nineties.name': 'Bust-A-Move 4'},\n",
       " {'nineties.name': 'NFL Quarterback Club 97'},\n",
       " {'nineties.name': 'Barbie Super Sports'},\n",
       " {'nineties.name': 'Chou-Kuukan Night Pro Yakyuu King(higher JP sales)'},\n",
       " {'nineties.name': 'Rampage 2: Universal Tour'},\n",
       " {'nineties.name': 'NBA Jam Extreme'},\n",
       " {'nineties.name': 'NHL Championship 2000'},\n",
       " {'nineties.name': 'Kartia: The Word of Fate'},\n",
       " {'nineties.name': \"Kirby's Star Stacker\"},\n",
       " {'nineties.name': 'Jackie Chan: Stuntmaster'},\n",
       " {'nineties.name': 'Sports Car GT'},\n",
       " {'nineties.name': 'Kanzen Chuuki Pro Yakyuu Greatest Nine'},\n",
       " {'nineties.name': 'Sailor Moon'},\n",
       " {'nineties.name': 'Pandemonium!'},\n",
       " {'nineties.name': \"Pro Yakyuu Greatest Nine '97\"},\n",
       " {'nineties.name': 'Lunar: Silver Star Story Complete'},\n",
       " {'nineties.name': 'EVE: burst error'},\n",
       " {'nineties.name': 'WCW Backstage Assault'},\n",
       " {'nineties.name': 'NOëL: NOT DiGITAL'},\n",
       " {'nineties.name': 'Dragon Ball Z Hyper Dimension'},\n",
       " {'nineties.name': 'ClayFighter 63 1/3'},\n",
       " {'nineties.name': 'Monopoly'},\n",
       " {'nineties.name': 'WCW Nitro'},\n",
       " {'nineties.name': 'Gex 3: Deep Cover Gecko'},\n",
       " ...]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d176b9d2-ec33-423a-b3de-e9bc87810fe7",
   "metadata": {},
   "source": [
    "### Pattern matching with multiple nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dd8ae45b-c131-4e39-a937-704855cbdd74",
   "metadata": {
    "height": 98
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (game:Game)-[:BELONGS_TO_GENRE]->(genre:Genre) \n",
    "  RETURN game.name, genre.name LIMIT 10\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "004147cc-14f4-43eb-86ff-d22e11a1d0d2",
   "metadata": {
    "height": 98
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (game:Game {name:\"New Super Mario Bros.\"})-[:PUBLISHED_BY]->(m)<-[:PUBLISHED_BY]-(otherGames) \n",
    "  RETURN otherGames.name, otherGames.global_sales\n",
    "  \"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2ad3f683-d334-4c4e-b274-9789a70b9662",
   "metadata": {},
   "source": [
    "### Delete data from the graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5850550",
   "metadata": {},
   "source": [
    "Before"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "5064cab8-b5d6-4f1c-b5ef-f154f5c10b2b",
   "metadata": {
    "height": 98
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'game.name': 'Nintendogs', 'publisher.name': 'Nintendo'}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (game:Game {name:\"Nintendogs\"})-[published_by:PUBLISHED_BY]->(publisher:Publisher)\n",
    "RETURN game.name, publisher.name\n",
    "\"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5757340d",
   "metadata": {},
   "source": [
    "Deleting Data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "521bb16f",
   "metadata": {},
   "source": [
    "We need to delete relationship first then only we can delete node."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "648d12d1-0966-46ff-ad77-080eae553c3a",
   "metadata": {
    "height": 98
   },
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (game:Game {name:\"Nintendogs\"})-[published_by:PUBLISHED_BY]->(publisher:Publisher)\n",
    "DELETE published_by\n",
    "\"\"\"\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1c7d502e",
   "metadata": {},
   "source": [
    "After"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cb417dd1",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (game:Game {name:\"Nintendogs\"})-[published_by:PUBLISHED_BY]->(publisher:Publisher)\n",
    "RETURN game.name, publisher.name\n",
    "\"\"\"\n",
    "kg.query(cypher)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
